export const NOT_YOUR_BUTTON = 'Это не твоя кнопка 😊'

export const TOO_SHORT =
  'Недостаточно текста для поиска. Пожалуйста, уточни запрос.'

export const NOT_FOUND =
  'Не удалось найти пункт правил, содержащий такой текст.'

export const TOO_COMMON = [
  'Похоже, что это слишком частая фраза,',
  'она встречается во многих пунктах правил.',
  'Пожалуйста, уточни запрос, чтобы сузить поиск.',
].join(' ')

export const SELECT_VARIANT = [
  'Эта фраза встречается в нескольких пунктах правил.',
  'Пожалуйста, выбери один из них.',
].join(' ')

export const HOT_TO_SEARCH = `${[
  'Чтобы воспользоваться этой командой,',
  'необходимо задать в ней строку для поиска совпадений.',
  'Сейчас научу! Скопируй этот пример (нажми на него) и отправь:',
].join(' ')}\n<code>/r сражение героев</code>`
